In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
#create series
ser1 = Series (np.arange(3), index=['A','B','C'])

ser1 = 2*ser1

ser1

A    0
B    2
C    4
dtype: int64

In [5]:
#select data by index name
ser1['B']

2

In [6]:
#select data by numerical value. index starts 0
ser1[1]

2

In [8]:
#select data by range
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [9]:
#select data by range of index value
ser1[['A','B']]

A    0
B    2
dtype: int64

In [10]:
#select data by logic (boolean or basic equsion)
ser1[ser1>3]

C    4
dtype: int64

In [11]:
#set values
ser1[ser1>3] = 10

In [12]:
ser1

A     0
B     2
C    10
dtype: int64

In [14]:
dFrame = DataFrame(np.arange(25).reshape((5,5)),index=['NYC','LA','SF','DC','Chi'], 
                   columns=['A','B','C','D','E'])

dFrame

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [15]:
#select data from Dataframe - using column dame
dFrame['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int64

In [16]:
#select multiple columns
dFrame[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [17]:
#use boolean to select
dFrame[dFrame['C']>8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [18]:
dFrame

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [19]:
#using boolean
dFrame>10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [20]:
#labeling - instead of .ix
dFrame.loc['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [22]:
#iloc instead of .ix
dFrame.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64